<?php


use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;


class PermissionTableSeeder extends Seeder
{
/**
* Run the database seeds.
*
* @return void
*/
public function run()
    {
        $permissions = [
            
            'الإعدادت',

            'الإعدادات النظام',
            'إعدادات الفروع',
            'إعدادات البرنامج',
            'إعدادات المؤسسة',
            'إعدادات الطابعات',
            'إعدادات الضريبة',
            'إعدادات الخزنة',
            'معاملات الخزنة',

            'إعدادات الحسابات',
            'أنواع الحسابات',
            'الحسابات',
            'الحركات المالية',
            'السنة المالية',
            'كشف الحساب',
            'ميزان المراجعة',
            'دفتر الأستاذ',
            'الميزانية العمومية',
            'قائمة الدخل',
            

            'إدارة المستخدمين',
            'المستخدمين',
            'قائمة المستخدمين',
            'صلاحيات المستخدمين',



            'إدارة المخزن',
            'المخازن ',
            'قائمة المخازن ',
            'إضافة مخزن',
            'جرد المخزن',

            'إدارة الأصناف',
            'الأصناف',
            'إضافة مجموعات',
            'إضافة الوحدات',
            'إضافة صنف',


            'إدارة الفواتير',
            'المشتريات',
            'فاتورة مشتريات',
            'مرتجع المشتريات',

            'المبيعات',
            'فاتورة مبيعات',
            'مرتجع مبيعات',

            'عروض السعر',
            'إضافة عرض سعر',

            'العملاء/الموردين',

            'الموردين',
            'إضافة مورد',
            'سند صرف',

            'العملاء',
            'إضافة عميل',
            'سند قبض',

            'إدارة الموظفين',

            'الموظفين',
            'قائمة الموظفين',
            'راتب الموظف',

            'إدارة المصروفات',

            'المصروفات',
            'التصنيف',
            'إضافة مصروف',

            'إدارة التقارير',

            'التقارير',
            'تقارير الفواتير',
            'تقرير جميع الفاواتير',
            'تقارير المبيعات',
            'تقرير المبيعات',
            'تقرير مرتجع المبيعات',
            'تقارير المشتريات',
            'تقرير المشتريات',
            'تقرير مرتجع المشتريات',
            'تقارير الأصناف',
            'تقرير مجموعة الأصناف',
            'تقرير الوحدات',
            'تقرير الأصناف',

            'إدارة الدعم',
            'الدعم',
            'دعم',
            'دعم فني',

            'الإشتراكات',
            'الإشتراك',
            'شاشة متابعة الاشتراك',
            'إدارة الاشتراك',
            'تاريخ المدفوعات',



            'اضافة مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',

            'اضافة صلاحية',
            'عرض صلاحية',
            'تعديل صلاحية',
            'حذف صلاحية'

        ];


    foreach ($permissions as $permission) {
        Permission::create(['name' => $permission]);

        }

    }
}