<?php

return [

    /*
    |----------------------------------------------------------------------
    | خطوط لغة إعادة تعيين كلمة المرور
    |----------------------------------------------------------------------
    |
    | يتم استخدام خطوط اللغة التالية كرسائل افتراضية تتوافق مع الأسباب
    | التي يقدمها الوسيط لإعادة تعيين كلمة المرور في حال فشل محاولة
    | التحديث، مثل وجود رمز غير صالح أو كلمة مرور جديدة غير صالحة.
    |
    */

    'reset' => 'تم إعادة تعيين كلمة المرور بنجاح!',
    'sent' => 'لقد تم إرسال رابط إعادة تعيين كلمة المرور إلى بريدك الإلكتروني!',
    'throttled' => 'يرجى الانتظار قبل المحاولة مرة أخرى.',
    'token' => 'رمز إعادة تعيين كلمة المرور غير صالح.',
    'user' => "لا يمكننا العثور على مستخدم باستخدام عنوان البريد الإلكتروني هذا.",

];
